---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpanDirInstParamAngle
source: html/b3c41365-74f0-b953-46b4-39a9771f30cc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpanDirInstParamAngle Property

"Span Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId SpanDirInstParamAngle { get; }
```